Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: But fancier polymorphic actions that need to know the specific return type of the mock function can define templated conversion operators to make that possible.
it_it: Ma azioni polimorfiche più sofisticate che necessitano di conoscere il tipo di ritorno specifico della funzione mock possono definire operatori di conversione basati su template per renderlo possibile.

source: But fear not - MockFunction can help you with that.
it_it: Niente paura - MockFunction è d'aiuto.

source: But fear not - `MockFunction` can help you with that.
it_it: Niente paura - `MockFunction` è d'aiuto.

source: But how could we introduce a change that breaks existing tests?
it_it: Ma come potremmo introdurre un cambiamento che renda non funzionanti i test esistenti?

source: But if you think it will return 100 every time, think twice!
it_it: Ma se si crede che restituirà 100 ogni volta, è meglio pensarci due volte!

source: But isn't this awkward?
it_it: Ma non è imbarazzante?

source: But maybe you think that writing all those main functions is too much work?
it_it: Ma forse si sta pensando che scrivere tutte queste funzioni di main sia troppo?

source: But maybe you think that writing all those `main` functions is too much work?
it_it: Ma forse si sta pensando che scrivere tutte queste funzioni di `main` sia troppo?

source: But that's getting complicated.
it_it: Ma la cosa sta diventando complicata.

source: But the term *Test Case* as was used in Google Test is of contradictory sense and thus confusing.
it_it: Ma il termine *Test Case* così come è stato utilizzato in Google Test ha un senso contraddittorio e quindi crea confusione.

source: But the term Test Case as was used in Google Test is of contradictory sense and thus confusing.
it_it: Ma il termine Test Case così come è stato utilizzato in Google Test ha un senso contraddittorio e quindi crea confusione.

source: But what if bar cannot be copied (i.e. has no copy constructor)?
it_it: Ma cosa succede se bar non può essere copiato (cioè non ha un costruttore di copia)?

source: But what if `bar` cannot be copied (i.e. has no copy constructor)?
it_it: Ma cosa succede se `bar` non può essere copiato (cioè non ha un costruttore di copia)?

source: By all means, NO!
it_it: Certamente NO!

source: By changing ~Base() to virtual, ~Derived() will be correctly called when delete p is executed, and the heap checker will be happy.
it_it: Cambiando ~Base() in virtual, ~Derived() verrà chiamato correttamente quando viene eseguito delete p e il checker dell'heap sarà contento.

source: By changing `~Base()` to virtual, `~Derived()` will be correctly called when `delete p` is executed, and the heap checker will be happy.
it_it: Cambiando `~Base()` in virtual, `~Derived()` verrà chiamato correttamente quando viene eseguito `delete p` e il checker dell'heap sarà soddisfatto.

source: By convention, you should give it the name FooTest where Foo is the class being tested.
it_it: Per convenzione, si da il nome FooTest dove Foo è la classe da testare.

source: By convention, you should give it the name `FooTest` where `Foo` is the class being tested.
it_it: Per convenzione, si da il nome `FooTest` dove `Foo` è la classe da testare.

source: By creating an object of type InSequence, all expectations in its scope are put into a sequence and have to occur sequentially.
it_it: Creando un oggetto di tipo InSequence, tutte le expectation nel suo scope vengono inserite in una sequenza e devono verificarsi sequenzialmente.

source: By creating an object of type `InSequence`, all expectations in its scope are put into a *sequence* and have to occur *sequentially*.
it_it: Creando un oggetto di tipo `InSequence`, tutte le expectation nel suo scope vengono inserite in una *sequenza* e devono verificarsi *sequenzialmente*.

source: By default, GoogleTest prints 1 line of output for each test, indicating if it passed or failed.
it_it: Per default, GoogleTest stampa 1 riga di output per ogni test, indicando se è stato superato o meno.

source: By default, GoogleTest prints the time it takes to run each test.
it_it: Per default, GoogleTest stampa il tempo necessario per eseguire ciascun test.

source: By default, GoogleTest uses a random seed calculated from the current time.
it_it: Per default, GoogleTest utilizza un seme casuale calcolato dall'ora corrente.

source: By default, a GoogleTest program runs all tests the user has defined.
it_it: Per default, un programma GoogleTest esegue tutti i test definiti dall'utente.

source: By default, an expectation can match a call even though an earlier expectation hasn't been satisfied.
it_it: Per default, una expectation può corrispondere a una chiamata anche se una expectation precedente non è stata soddisfatta.

source: By default, every TEST_P call without a corresponding INSTANTIATE_TEST_SUITE_P call causes a failing test in the test suite GoogleTestVerification.
it_it: Per default, ogni chiamata a TEST_P senza una corrispondente chiamata a INSTANTIATE_TEST_SUITE_P provoca un test non riuscito nella test suite GoogleTestVerification.

source: By default, every [`TEST_P`](#TEST_P) call without a corresponding [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P) call causes a failing test in the test suite `GoogleTestVerification`.
it_it: Per default, ogni chiamata a [`TEST_P`](#TEST_P) senza una corrispondente chiamata a [`INSTANTIATE_TEST_SUITE_P`](#INSTANTIATE_TEST_SUITE_P) provoca un test non riuscito nella test suite `GoogleTestVerification`.

source: By default, expectations can be matched in *any* order.
it_it: Per default, le expectation possono essere soddisfatte in *qualsiasi* ordine.

source: By default, expectations can be matched in any order.
it_it: Per default, le expectation possono essere soddisfatte in qualsiasi ordine.

source: By default, expectations don't have to be matched in *any* particular order.
it_it: Per default, non è necessario che le expectation corrispondano in *ogni* particolare ordine.

source: By default, expectations don't have to be matched in any particular order.
it_it: Per default, non è necessario che le expectation corrispondano in ogni particolare ordine.

source: By default, the results are printed to standard output.
it_it: Per default, i risultati vengono stampati sull'output standard.

source: By default, when a mock method is invoked, gMock will search the expectations in the reverse order they are defined, and stop when an active expectation that matches the arguments is found (you can think of it as "newer rules override older ones.").
it_it: Per default, quando viene richiamato un metodo mock, gMock cercherà le expectation nell'ordine inverso in cui sono definite e si fermerà quando viene trovata una expectation attiva che corrisponde agli argomenti (si possono considerare come "le regole più recenti scavalcano quelle più vecchie").

source: By default, when a mock method is invoked, gMock will search the expectations in the **reverse order** they are defined, and stop when an active expectation that matches the arguments is found (you can think of it as "newer rules override older ones.").
it_it: Per default, quando viene richiamato un metodo mock, gMock cercherà le expectation nell'**ordine inverso** in cui sono definite e si fermerà quando viene trovata una expectation attiva che corrisponde agli argomenti (si possono considerare come "le regole più recenti scavalcano quelle più vecchie").

source: By defining a new mock method with a trimmed argument list, we make the mock class more user-friendly.
it_it: Definendo un nuovo metodo mock con un elenco di argomenti ridotto, rendiamo la classe mock più user-friendly.

source: By designing your own interface, you have a chance to tailor it to your need - you may add higher-level functionalities, rename stuff, etc instead of just trimming the class.
it_it: Ne progettare l'interfaccia, si ha la possibilità di adattarla alle proprie esigenze: si possono aggiungere funzionalità di livello superiore, rinominare elementi, ecc. invece di limitarsi a ritagliare la classe.

source: By initializing a member variable in the constructor, we have the option to make it const, which helps prevent accidental changes to its value and makes the tests more obviously correct.
it_it: Inizializzando una variabile membro nel costruttore, abbiamo la possibilità di renderla const, il che aiuta a prevenire modifiche accidentali al suo valore e rende i test ovviamente più corretti.

source: By initializing a member variable in the constructor, we have the option to make it `const`, which helps prevent accidental changes to its value and makes the tests more obviously correct.
it_it: Inizializzando una variabile membro nel costruttore, abbiamo la possibilità di renderla `const`, il che aiuta a prevenire modifiche accidentali al suo valore e rende i test ovviamente più corretti.

source: By placing it in a non-void function you'll get a confusing compile error like "error: void value not ignored as it ought to be" or "cannot initialize return object of type 'bool' with an rvalue of type 'void'" or "error: no viable conversion from 'void' to 'string'".
it_it: Inserendola in una funzione non void si otterrà un errore di compilazione confuso del tipo "error: void value not ignored as it ought to be" o "cannot initialize return object of type 'bool' with an rvalue of type 'void'" o "error: no viable conversion from 'void' to 'string'".

source: By placing it in a non-void function you'll get a confusing compile error like `"error: void value not ignored as it ought to be"` or `"cannot initialize return object of type 'bool' with an rvalue of type 'void'"` or `"error: no viable conversion from 'void' to 'string'"`.
it_it: Inserendola in una funzione non void si otterrà un errore di compilazione confuso del tipo `"error: void value not ignored as it ought to be"` o `"cannot initialize return object of type 'bool' with an rvalue of type 'void'"` o `"error: no viable conversion from 'void' to 'string'"`.

source: By studying the trace, you'll gain insights on why the expectations you set are not met.
it_it: Studiando il trace, si otterranno informazioni sul motivo per cui le aspettative [expectation] impostate non vengono soddisfatte.

source: By the way, the other situation where an expectation may *not* be sticky is when it's in a sequence - as soon as another expectation that comes after it in the sequence has been used, it automatically retires (and will never be used to match any call).
it_it: A proposito, l'altra situazione in cui una expectation può *non* essere appiccicosa è quando è in una sequenza: non appena viene utilizzata un'altra expectation che viene dopo di essa nella sequenza, viene automaticamente 'ritirata' (e non verrà mai più usata per abbinare alcuna chiamata).

source: By the way, the other situation where an expectation may not be sticky is when it's in a sequence - as soon as another expectation that comes after it in the sequence has been used, it automatically retires (and will never be used to match any call).
it_it: A proposito, l'altra situazione in cui una expectation può non essere appiccicosa è quando è in una sequenza: non appena viene utilizzata un'altra expectation che viene dopo di essa nella sequenza, viene automaticamente 'ritirata' (e non verrà mai più usata per abbinare alcuna chiamata).

source: By using fixtures, each test has a fresh set of variables that's different (but with the same names).
it_it: Utilizzando le fixture, ogni test ha un nuovo set di variabili diverse (ma con gli stessi nomi).

source: By writing
it_it: Scrivendo

source: C++ does not allow virtual function calls in constructors and destructors.
it_it: Il C++ non consente chiamate di funzioni virtuali nei costruttori e nei distruttori.

source: C++ functions often take pointers as arguments.
it_it: Le funzioni C++ spesso accettano puntatori come argomenti.

source: C++ is case-sensitive.
it_it: Il C++ fa distinzione tra maiuscole e minuscole.

source: C++'s look-up rules // rely on that.
it_it: Le regole di ricerca del C++ // si basano su questo.

source: C++11 introduced *move-only types*.
it_it: Il C++11 ha introdotto i *tipi move-only* (tipi di solo spostamento).

source: C++11 introduced move-only types.
it_it: Il C++11 ha introdotto i tipi move-only (tipi di solo spostamento).

source: CMake uses a file named CMakeLists.txt to configure the build system for a project.
it_it: CMake usa un file chiamato CMakeLists.txt per configurare il sistema di build per un progetto.

source: CMake uses a file named `CMakeLists.txt` to configure the build system for a project.
it_it: CMake usa un file chiamato `CMakeLists.txt` per configurare il sistema di build per un progetto.

source: Calling RecordProperty() outside of the lifespan of a test is allowed.
it_it: È consentito chiamare RecordProperty() al di fuori della durata [lifespan] di un test.

source: Calling `RecordProperty()` outside of the lifespan of a test is allowed.
it_it: È consentito chiamare `RecordProperty()` al di fuori della durata [lifespan] di un test.

source: Calling it more than once conflicts with some advanced GoogleTest features (e.g., thread-safe death tests) and thus is not supported.
it_it: Chiamandola più volte, si entra in conflitto con delle funzionalità avanzate di GoogleTest (ad esempio, i death test thread-safe) e quindi non è supportato.

source: Calling it more than once conflicts with some advanced GoogleTest features (e.g., thread-safe [death tests](advanced.md#death-tests)) and thus is not supported.
it_it: Chiamandola più volte, si entra in conflitto con delle funzionalità avanzate di GoogleTest (ad esempio, i [death tests](advanced.md#death-tests)) e quindi non è supportato.

source: Calls to RecordProperty made during the lifespan of the test (from the moment its constructor starts to the moment its destructor finishes) are output in XML as attributes of the <testcase> element.
it_it: Le chiamate a RecordProperty effettuate durante la durata del test (dal momento in cui inizia il suo costruttore al momento in cui termina il suo distruttore) vengono restituite in XML come attributi dell'elemento <testcase>.

source: Calls to RecordProperty made in the global context (before or after invocation of RUN_ALL_TESTS or from the SetUp/TearDown methods of registered Environment objects) are output as attributes of the <testsuites> element.
it_it: Le chiamate a RecordProperty effettuate nel contesto globale (prima o dopo l'invocazione di RUN_ALL_TESTS o dai metodi SetUp/TearDown degli oggetti Environment registrati) vengono emessi come attributi dell'elemento <testsuites>.

source: Calls to `RecordProperty` made during the lifespan of the test (from the moment its constructor starts to the moment its destructor finishes) are output in XML as attributes of the `<testcase>` element.
it_it: Le chiamate a `RecordProperty` effettuate durante la durata del test (dal momento in cui inizia il suo costruttore al momento in cui termina il suo distruttore) vengono restituite in XML come attributi dell'elemento `<testcase>`.

source: Calls to `RecordProperty` made in the global context (before or after invocation of `RUN_ALL_TESTS` or from the `SetUp`/`TearDown` methods of registered `Environment` objects) are output as attributes of the `<testsuites>` element.
it_it: Le chiamate a `RecordProperty` effettuate nel contesto globale (prima o dopo l'invocazione di `RUN_ALL_TESTS` o dai metodi `SetUp`/`TearDown` degli oggetti `Environment` registrati) vengono emessi come attributi dell'elemento `<testsuites>`.

source: Can I derive a test fixture from another?
it_it: Posso derivare una fixture da un'altra?

source: Can I mock a variadic function?
it_it: Posso mock-are una funzione variadica?

source: Can I mock it?
it_it: Posso renderla mock?

source: Can be removed from the listeners list to shut down default console output.
it_it: Può essere rimosso dall'elenco dei listener per disattivare l'output della console di default.

source: Can be removed from the listeners list by users who want to shut down the default XML output controlled by this flag and substitute it with custom one.
it_it: Può essere rimosso dall'elenco dei listener dagli utenti che desiderano arrestare l'output XML di default controllato da questo flag e sostituirlo con uno personalizzato.

source: Can be used in individual test cases or in the SetUp() methods of test environments or test fixtures (classes derived from the Environment or Test classes).
it_it: Utilizzabile nei singoli casi di test o nei metodi SetUp() di ambienti di test o di fixture (classi derivate dalle classi Environment o Test).

source: Can be used in individual test cases or in the `SetUp()` methods of test environments or test fixtures (classes derived from the [`Environment`](#Environment) or [`Test`](#Test) classes).
it_it: Utilizzabile nei singoli casi di test o nei metodi `SetUp()` di ambienti di test o di fixture (classi derivate dalle classi [`Environment`](#Environment) o [`Test`](#Test)).

source: Can only be used in functions that return void.
it_it: Può essere utilizzato solo nelle funzioni che restituiscono void.

source: Can only be used in functions that return `void`.
it_it: Può essere utilizzato solo nelle funzioni che restituiscono `void`.

source: Can you disable a test temporarily?
it_it: È possibile disattivare temporaneamente un test?

source: Can you specify an arbitrary partial order?
it_it: È possibile specificare un arbitrario ordine parziale?

source: Cardinalities {#CardinalityList}
it_it: Cardinalità {#CardinalityList}

source: Cardinalities: How Many Times Will It Be Called?
it_it: Le Cardinalità: Quante Volte Verrà Chiamata?

source: Cardinality
it_it: Cardinalità

source: Case solved.
it_it: Caso risolto.

source: Casting Matchers {#SafeMatcherCast}
it_it: Casting dei Matcher {#SafeMatcherCast}

source: Causes the current file name, line number, and the given message *`message`* to be added to the failure message for each assertion failure that occurs in the scope.
it_it: Fa sì che il nome file corrente, il numero di riga e il messaggio *`message`* specificato vengano aggiunti al messaggio di errore per ogni errore di asserzione che si verifica nello scope.

source: Causes the current file name, line number, and the given message message to be added to the failure message for each assertion failure that occurs in the scope.
it_it: Fa sì che il nome file corrente, il numero di riga e il messaggio message specificato vengano aggiunti al messaggio di errore per ogni errore di asserzione che si verifica nello scope.

source: Caveats
it_it: Avvertenze

source: Changing a Mock Object's Behavior Based on the State
it_it: Modifica del Comportamento di un Oggetto Mock in Base allo Stato

source: Check here first.
it_it: Controllare prima qui.

source: Check it out.
it_it: Consultarlo.

source: Checking for Failures in the Current Test
it_it: Verifica degli Errori nel Test Corrente

source: Class templates can be mocked just like any class.
it_it: Le classi templates si possono rendere mocked proprio come qualsiasi classe.

source: Classes and types
it_it: Classi e tipi

source: Classes {#classes}
it_it: Le Classi {#classes}

source: Cleans up the fixture via TearDown().
it_it: Ripulisce la fixture tramite TearDown().

source: Cleans up the fixture via `TearDown()`.
it_it: Ripulisce la fixture tramite `TearDown()`.

source: Clearly, if the square root of 0 is anything but 0, there isn't much left to test anyway.
it_it: Chiaramente, se la radice quadrata di 0 è tutt'altro che 0, non resta comunque molto da testare.

source: Clearly, one size doesn't fit all.
it_it: Chiaramente, una sola taglia non va bene per tutti.

source: Code Samples
it_it: Codici di Esempio

source: Colored Terminal Output
it_it: Output Colorato del Terminale

source: Combining Actions
it_it: Combinazione di Azioni

source: Combining Matchers {#CombiningMatchers}
it_it: Combinazione di Matcher {#CombiningMatchers}

source: Come think of it, after the first time the action runs, the source value will be consumed (since it’s a move-only value), so the next time around, there’s no value to move from -- you’ll get a run-time error that Return(std::move(...)) can only be run once.
it_it: Rifletteteci, dopo la prima volta che viene eseguita l'azione, il valore sorgente verrà consumato (poiché è un valore di solo spostamento [move-only]), quindi la volta successiva, non c'è alcun valore da spostare - si otterrà un errore a run-time secondo cui Return(std::move(...)) può essere eseguito solo una volta.

source: Come think of it, after the first time the action runs, the source value will be consumed (since it’s a move-only value), so the next time around, there’s no value to move from -- you’ll get a run-time error that `Return(std::move(...))` can only be run once.
it_it: Rifletteteci, dopo la prima volta che viene eseguita l'azione, il valore sorgente verrà consumato (poiché è un valore di solo spostamento [move-only]), quindi la volta successiva, non c'è alcun valore da spostare - si otterrà un errore a run-time secondo cui `Return(std::move(...))` può essere eseguito solo una volta.

source: Community Documentation
it_it: Documentazione della Community

source: Community-Created Documentation
it_it: Documentazione Creata dalla Comunità

source: Compared with the style where each TEST has many EXPECT_CALLs, this leads to tests that are more resilient to implementational changes (and thus less likely to require maintenance) and makes the intent of the tests more obvious (so they are easier to maintain when you do need to maintain them).
it_it: Rispetto allo stile in cui ogni TEST ha molte EXPECT_CALL, questo porta a test più resilienti alle modifiche implementative (e quindi con meno probabilità di richiedere manutenzione) e rende l'intento dei test più ovvi (quindi sono più facili da manutenere).

source: Compared with the style where each `TEST` has many `EXPECT_CALL`s, this leads to tests that are more resilient to implementational changes (and thus less likely to require maintenance) and makes the intent of the tests more obvious (so they are easier to maintain when you do need to maintain them).
it_it: Rispetto allo stile in cui ogni `TEST` ha molte `EXPECT_CALL`, questo porta a test più resilienti alle modifiche implementative (e quindi con meno probabilità di richiedere manutenzione) e rende l'intento dei test più ovvi (quindi sono più facili da manutenere).

source: Compatible build tools include Make, Ninja, and others - see CMake Generators for more information.
it_it: Gli strumenti di build compatibili includono Make, Ninja ed altri - consultare CMake Generators per ulteriori informazioni.

source: Compatible build tools include [Make](https://www.gnu.org/software/make/), [Ninja](https://ninja-build.org/), and others - see [CMake Generators](https://cmake.org/cmake/help/latest/manual/cmake-generators.7.html) for more information.
it_it: Gli strumenti di build compatibili includono [Make](https://www.gnu.org/software/make/), [Ninja](https://ninja-build.org/) ed altri - consultare [CMake Generators](https://cmake.org/cmake/help/latest/manual/cmake-generators.7.html) per ulteriori informazioni.

source: Compile-time assertion for type equality.
it_it: Asserzione in fase di compilazione per l'uguaglianza dei tipi.

source: Compiles if and only if T1 and T2 are the same type.
it_it: Compila se e solo se T1 e T2 sono dello stesso tipo.

source: Compiles if and only if `T1` and `T2` are the same type.
it_it: Compila se e solo se `T1` e `T2` sono dello stesso tipo.

source: Composite Actions
it_it: Action Composite

source: Composite Matchers
it_it: Matcher Compositi

source: Conclusion
it_it: Conclusione
